In [3]:
import duckdb

In [4]:
con = duckdb.connect(database='dados_duckdb.db', read_only=False)

In [5]:
df = con.execute("SELECT * FROM produtos").fetchdf()
df.head()

      id nm_produto id_categoria  id_fornecedor  vl_preco
0  10001   PARAFUSO         BT10            100     100.0
1   1003      PREGO         BT10            100      50.0
2  10002    MARTELO         BT50            100    1500.0
3  10001   PARAFUSO         BT10            100     100.0
4   1003      PREGO         BT10            100      50.0

In [6]:
df2 = df.drop(columns= ['id_categoria', 'id_fornecedor'])
df2.head()

      id nm_produto  vl_preco
0  10001   PARAFUSO     100.0
1   1003      PREGO      50.0
2  10002    MARTELO    1500.0
3  10001   PARAFUSO     100.0
4   1003      PREGO      50.0

In [ ]:
con.execute("""
    DROP TABLE dim_produtos
    """)

In [7]:
con.execute("""
    CREATE TABLE IF NOT EXISTS dim_produtos (
        id_produto BIGINT,
        nm_produto TEXT,
        vl_produto FLOAT
    )
""")

In [9]:
con.execute("INSERT INTO dim_produtos SELECT * FROM df2")

In [10]:
df_dim = con.execute("SELECT * FROM dim_produtos").fetchdf()
df_dim.head()

   id_produto nm_produto  vl_produto
0       10001   PARAFUSO       100.0
1        1003      PREGO        50.0
2       10002    MARTELO      1500.0
3       10001   PARAFUSO       100.0
4        1003      PREGO        50.0